{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"trainable": true, "function_type": "lambda", "arguments": {}, "input_dtype": "float32", "batch_input_shape": [null, 50, 160, 3], "output_shape": null, "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u0000`@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>B\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "same", "subsample": [2, 2], "nb_col": 5, "trainable": true, "W_constraint": null, "b_constraint": null, "nb_row": 5, "W_regularizer": null, "name": "convolution2d_1", "nb_filter": 16, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "same", "subsample": [2, 2], "nb_col": 5, "trainable": true, "W_constraint": null, "b_constraint": null, "nb_row": 5, "W_regularizer": null, "name": "convolution2d_2", "nb_filter": 32, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "same", "subsample": [2, 2], "nb_col": 5, "trainable": true, "W_constraint": null, "b_constraint": null, "nb_row": 5, "W_regularizer": null, "name": "convolution2d_3", "nb_filter": 48, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "same", "subsample": [1, 1], "nb_col": 3, "trainable": true, "W_constraint": null, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "name": "convolution2d_4", "nb_filter": 64, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "same", "subsample": [1, 1], "nb_col": 3, "trainable": true, "W_constraint": null, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "name": "convolution2d_5", "nb_filter": 64, "activity_regularizer": null}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "same", "subsample": [1, 1], "nb_col": 3, "trainable": true, "W_constraint": null, "b_constraint": null, "nb_row": 3, "W_regularizer": null, "name": "convolution2d_6", "nb_filter": 64, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "th", "trainable": true, "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.25, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 100, "bias": true, "input_dim": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 50, "bias": true, "input_dim": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 10, "bias": true, "input_dim": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "output_dim": 1, "bias": true, "input_dim": null, "activation": "linear", "init": "glorot_uniform", "trainable": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "W_constraint": null, "W_regularizer": null}}], "keras_version": "1.1.2"}