{"keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "batch_input_shape": [null, 66, 200, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00e2\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "input_dtype": "float32", "output_shape": null}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "name": "convolution2d_1", "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 24, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "name": "convolution2d_2", "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 36, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 5, "name": "convolution2d_3", "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 5, "nb_filter": 48, "b_constraint": null, "W_regularizer": null, "subsample": [2, 2], "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3, "name": "convolution2d_4", "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"border_mode": "valid", "bias": true, "activity_regularizer": null, "b_regularizer": null, "trainable": true, "nb_col": 3, "name": "convolution2d_5", "W_constraint": null, "init": "he_normal", "dim_ordering": "tf", "nb_row": 3, "nb_filter": 64, "b_constraint": null, "W_regularizer": null, "subsample": [1, 1], "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "output_dim": 100, "b_regularizer": null, "name": "dense_1", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.2}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "output_dim": 50, "b_regularizer": null, "name": "dense_2", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "p": 0.2}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "output_dim": 10, "b_regularizer": null, "name": "dense_3", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}}, {"class_name": "Dense", "config": {"bias": true, "input_dim": null, "W_constraint": null, "output_dim": 1, "b_regularizer": null, "name": "dense_4", "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "activity_regularizer": null, "activation": "linear"}}], "class_name": "Sequential"}