{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"output_shape": null, "output_shape_type": "raw", "arguments": {}, "input_dtype": "float32", "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00ec\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 66, 200, 3], "trainable": true, "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_1", "W_regularizer": null, "nb_col": 5, "trainable": true, "W_constraint": null, "init": "he_normal", "bias": true, "nb_row": 5, "dim_ordering": "tf", "nb_filter": 24, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_2", "W_regularizer": null, "nb_col": 5, "trainable": true, "W_constraint": null, "init": "he_normal", "bias": true, "nb_row": 5, "dim_ordering": "tf", "nb_filter": 36, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_3", "W_regularizer": null, "nb_col": 5, "trainable": true, "W_constraint": null, "init": "he_normal", "bias": true, "nb_row": 5, "dim_ordering": "tf", "nb_filter": 48, "activation": "linear", "subsample": [2, 2], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_4", "W_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "init": "he_normal", "bias": true, "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "b_regularizer": null, "name": "convolution2d_5", "W_regularizer": null, "nb_col": 3, "trainable": true, "W_constraint": null, "init": "he_normal", "bias": true, "nb_row": 3, "dim_ordering": "tf", "nb_filter": 64, "activation": "linear", "subsample": [1, 1], "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "name": "dense_1", "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "output_dim": 100, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "name": "dense_2", "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "output_dim": 50, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "name": "dense_3", "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "output_dim": 10, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_8", "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_constraint": null, "b_regularizer": null, "name": "dense_4", "W_regularizer": null, "trainable": true, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "bias": true, "activation": "linear", "output_dim": 1, "activity_regularizer": null}}]}